PeterVranken/TRK-USB-MPC5643L/LSM/kernelBuilder/code/startup/ihw_initMcuCoreHW.c
/**
 * @file ihw_initMcuCoreHW.c
 * Collection of required HW initialization routines. The routines relate to the basic
 * operation of the MCU, which requires a minimum of configuration, e.g. clock settings.
 * Moreover, the interrupt controller is enabled here.\n
 *   Note, the MMU configuration belongs to the set of configurations required for basic
 * MCU operation, too, but this can't be offered here. Without MMU configuration, we could
 * not reach or execute the code offered in this module.
 *
 * Copyright (C) 2017-2018 Peter Vranken (mailto:Peter_Vranken@Yahoo.de)
 *
 * This program is free software: you can redistribute it and/or modify it
 * under the terms of the GNU Lesser General Public License as published by the
 * Free Software Foundation, either version 3 of the License, or any later
 * version.
 *
 * This program is distributed in the hope that it will be useful, but WITHOUT
 * ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or
 * FITNESS FOR A PARTICULAR PURPOSE. See the GNU Lesser General Public License
 * for more details.
 *
 * You should have received a copy of the GNU Lesser General Public License
 * along with this program. If not, see <http://www.gnu.org/licenses/>.
 */
/* Module interface
 *   ihw_dummyINTCInterruptHandler
 *   ihw_installINTCInterruptHandler
 *   ihw_initMcuCoreHW
 * Local functions
 *   clearCriticalFaultFlags
 *   clearNonCriticalFaultFlags
 *   initModesAndClks
 *   initPBridge
 *   initINTCInterruptController
 */

/*
 * Include files
 */

#include <stddef.h>
#include <stdint.h>
#include <limits.h>
#include <assert.h>

#include "typ_types.h"
#include "MPC5643L.h"
#include "sup_settings.h"
#include "int_interruptHandler.h"
#include "ihw_initMcuCoreHW.h"


/*
 * Defines
 */


/*
 * Local type definitions
 */


/*
 * Local prototypes
 */

/** The empty default interrupt service routine. */
void ihw_dummyINTCInterruptHandler(void);


/*
 * Data definitions
 */

/** The table of function pointers into the actual IRQ handlers is implemented in the
    assembler code (There we have better control of the required alignment constraints.)\n
      Note, the entries in the table are normal, proper C functions; no considerations
    about specific calling conventions (e.g. without stack frame) or according type
    decorations need to be made. */
extern int_externalInterruptHandler_t int_INTCInterruptHandlerAry[256];

#if DEBUG
/** If an interrupt is enabled in an I/O device but there's no handler registered at the
    INTC then a dummy handler is installed, which will halt the software in an assertion
    and report the causing interrupt in this global variable.
      @remark This is a development tool only and not compiled in PRODUCTION compilation. */
volatile uint32_t ihw_idxUnregisteredInterrupt = UINT_MAX;
#endif


/*
 * Function implementation
 */

/**
 * Clear critical faults in fault collection and control unit (FCCU).
 *   @remark
 * This code is based on NXP sample MPC5643L-LINFlex-UART-DMA-CW210, file NXP main.c, l.
 * 91ff.
 */
static void clearCriticalFaultFlags()
{
    /** Critical fault key */
#define FCCU_CFK_KEY  0x618B7A50

    uint32_t u;
    for(u=0; u<4; ++u)
    {
        unsigned int cntAttempt = 0;
        while(cntAttempt++ < 100)
        {
            /* Initiate operation clear. */
            FCCU.CFK.R = FCCU_CFK_KEY;
            FCCU.CF_S[u].R = 0xffffffff;

            /* Wait for the completion of the operation - be it successfully or aborted. */
            unsigned int cntTimeout = 10000;
            while(cntTimeout-- > 0  &&  (FCCU.CTRL.B.OPS & 0x2) == 0)
            {}

            /* The MCU reference manual (22.6.8, p. 518f) suggests to read the cleared
               register back and test the bits. In case of failure one should repeat the
               sequence. */
            if(FCCU.CF_S[u].R == 0)
                break;
        }
    } /* for(All critical fault bit registers) */
#undef FCCU_CFK_KEY
} /* End of clearCriticalFaultFlags */



/**
 * Clear non critical faults in fault collection and control unit (FCCU).
 *   @remark
 * This code is based on NXP sample MPC5643L-LINFlex-UART-DMA-CW210, file NXP main.c, l.
 * 105ff.
 */
static void clearNonCriticalFaultFlags()
{
    /** Non-critical fault key */
#define FCCU_NCFK_KEY 0xAB3498FE

    uint32_t u;
    for(u=0; u<4; ++u)
    {
        unsigned int cntAttempt = 0;
        while(cntAttempt++ < 100)
        {
            /* Initiate operation clear. */
            FCCU.NCFK.R = FCCU_NCFK_KEY;
            FCCU.NCF_S[u].R = 0xffffffff;

            /* Wait for the completion of the operation - be it successfully or aborted. */
            unsigned int cntTimeout = 10000;
            while(cntTimeout-- > 0  &&  (FCCU.CTRL.B.OPS & 0x2) == 0)
            {}

            /* The MCU reference manual (22.6.10, p. 520) suggests to read the cleared
               register back and test the bits. In case of failure one should repeat the
               sequence. */
            if(FCCU.NCF_S[u].R == 0)
                break;
        }
    } /* for(All non critical fault bit registers) */
#undef FCCU_NCFK_KEY
} /* clearNonCriticalFaultFlags */


/**
 * Configure the clocks of the MCU. After reset and until here it the internal RC
 * oscillator is used at low clock rate. We configure the device to run the CPU and its
 * peripherals at the maximum clock rate of 120 MHz.
 *   @param enableClkOutputAtPB6
 * The system clock rate, as used by CPU and peripherals, can be connected to an external
 * CPU output. Set this to \a true to make the clock signal be measurable at port PB6, MCU
 * pin 136.
 *   @remark
 * Flash configuration needs to be done prior to this function in order to let the flash
 * support the higher clock rates (e.g. wait state configuration).
 *   @remark
 * This code is based on NXP sample MPC5643L-LINFlex-UART-DMA-CW210, file NXP main.c,
 * l. 144 ff.
 */
static void initModesAndClks(bool enableClkOutputAtPB6)
{
    /* Enable modes DRUN, RUN0, SAFE, RESET */
    ME.MER.R = 0x0000001D;

    CGM.OSC_CTL.R = 0x00800001;
    ME.DRUN.B.XOSCON = 1;

    /* Enter the drun mode, to update the configuration. */
    ME.MCTL.R = 0x30005AF0; /* Mode & Key */
    ME.MCTL.R = 0x3000A50F; /* Mode & Key inverted */

    /* Wait for mode entry to complete. */
    while(ME.GS.B.S_XOSC == 0)
    {}

    /* Wait for mode transition to complete. */
    while(ME.GS.B.S_MTRANS == 1)
    {}

    /* Check DRUN mode has been entered. */
    while(ME.GS.B.S_CURRENT_MODE != 3)
    {}

    /* Select Xosc as PLL source clock */
    CGM.AC3SC.R = 0x01000000; /* PLL0, system PLL */
    CGM.AC4SC.R = 0x01000000; /* PLL1, secondary PLL */

    /* Initialize PLL before turning it on (see MCU ref. manual, 27, p. 901ff):
       fsys = fcrystal*ndiv/idf/odf
       fvco = fcrystal/idf*ndiv
       fvco must be from 256 MHz to 512 MHz
       If we want fsys = 120 MHz: fvco = fsys*odf = 120 MHz * 4 = 480 MHz
       fsys =  40*72/6/4 = 120 MHz
       If we want fsys = 80 MHz: fvco = fsys*odf = 80 MHz * 4 = 320 MHz
       fsys =  40*64/8/4 = 80 MHz */

