PeterVranken/TRK-USB-MPC5643L/LSM/kernelBuilder/code/startup/ihw_initMcuCoreHW.c
    /* Block Configuration register, INTC_BCR0
       VTES_PRC0, 0x20: 0 for 4 Byte entries, 1 for 8 Byte entries
       HVEN_PRC0, 0x1, 0: SW vector, 1: HW vector mode */
    INTC.BCR.R = 0;

    /* The address of our vector table is stored in field VTBA_PRC0. Only the most
       significant 21 Bit will matter, the reset will at run-time be replaced by the index
       of the pending interrupt. */
    INTC.IACKR_PRC0.R = (uint32_t)&int_INTCInterruptHandlerAry[0];

    /* The current priority is set to 0. */
    INTC.CPR_PRC0.B.PRI = 0;

    /* Restore the machine status register including the enable external interrupt bit.
       For the normal, intended use case this won't have an effect. */
    ihw_leaveCriticalSection(msr);
    
} /* End of initINTCInterruptController */




/**
 * This function can be used to install an interrupt handler for a given interrupt vector.
 * It will also set the Priority Select Register for the source to the one given.
 *   @param interruptHandler
 * The interrupt handler. An ordinary C function in the user code area, which is called
 * when the according interrupt is served.
 *   @param vectorNum
 * All possible external interrupt sources are hardwired to the interrupt controller. They
 * are indentified by index. The table, which interrupt source (mostly I/O device) is
 * connected to the controller at which index can be found in the MCU reference manual,
 * section 28.7, table 28-4.
 *   @param psrPriority
 * The priority at which the interrupt is served. 0..15. 0 is useless, it would never be
 * served, 1 is the lowest real priority and 15 the highest. Preemption of a handler (if
 * enabled), which serves an interrupt of priority n will be possible only by another
 * interrupt of priority n+1 or higher.\n
 *   Note, kernel interrupts need to use priority 1. This is double-checked by assertion.
 *   @param isPreemptable
 * For each interrupt it can be sayed, whether it is preemptable by other interrupts of
 * higher priority or not. If this is \a false then the interrupt handler will always be
 * entered with the status bit EE reset in the machine status register MSR.\n
 *   Note, a handler, which has been declared non-premptable is allowed to set the EE bit
 * itself. It can thus first do some operations without any race-conditions with other
 * interrupts and then continue without further locking normal interrupt processing.
 *   @param isKernelInterrupt
 * Two types of interrupts are supported. The ordinary behave as usual, they preempt the
 * running context and return to the statement where they had preempted. A kernel relevant
 * interrupt is one, which can decide on return whether to behave like an oridnary one or
 * whether the return to another, currently suspended execution context. Pass \a true if \a
 * interruptHandler denotes a kernel relevant interrupt.\n
 *   Note, the function signature of the handler \a interruptHandler depends on whether it
 * is an ordinary or a kernel relevant interrupt.
 *   @remark
 * The function can be used at any time. It is possible to exchange a handler at run-time,
 * while interrrupts are being processed. However, the normal use case will rather be to
 * call this function for all required interrupts and only then call the other function
 * ihw_resumeAllInterrupts().\n
 *   This function must not be called for an interrupt number n from the context of that
 * interrupt n.
 */
void ihw_installINTCInterruptHandler( int_externalInterruptHandler_t interruptHandler
                                    , unsigned short vectorNum
                                    , unsigned char psrPriority
                                    , bool isPreemptable
                                    , bool isKernelInterrupt
                                    )
{
    /* Test the binary build-up of the interface with the assembly code. The assembler does
       not double-check the data types and code maintenance is not safely possible without
       these compile time tests. */
    INT_STATIC_ASSERT_INTERFACE_CONSISTENCY_C2AS
    
    /* We permit to use this function at any time, i.e. even while interrupts may occur. We
       need to disable them shortly to avoid inconsistent states (vector and priority). */
    uint32_t msr = ihw_enterCriticalSection();

    /* The Book E definition of kernelBuilder had specified the two least significant bits
       of the stored handler address as Boolean properties of the handler (kernel relevance
       and preemptability). For a VLE implementation this needs to be changed since handler
       address only have one safe unused bit, the least significant one; all handler
       addresses are 2 Byte aligned. We keep the concept but use another bit for the second
       property, the most significant bit.
         Implications: While the Book E definition is generally correct does the VLE
       definition depend on the memory layout; it'll fail if the text section is in the
       upper half of the 32 Bit address space. For this project, which is dedicated to the
       MPC5643L, there's no risk but easy portability to similar controllers with a
       possibly different memory map requires a run-time check if the made assumptions are
       met.
         For Book E an assertion would be sufficient; VLE must double check in any
       compilation configuration: The handler addresses will definitely differ between the
       configurations. Since the run-time check is cheap we can inherit it in the Book E
       implementation.
         We don't have a remedial action if the check fails. All we can do is what an
       assertion does: halting further code execution and reporting the problem through a
       connected debugger. This technique is adequate since the failure is a pure compile
       time problem. */
    const uintptr_t handlerAddress = isKernelInterrupt? (uintptr_t)interruptHandler.kernelIsr
                                                      : (uintptr_t)interruptHandler.simpleIsr;
#ifdef __VLE__
    const bool addressOk = (handlerAddress & 0x80000001) == 0;
#else
    const bool addressOk = (handlerAddress & 0x00000003) == 0;
#endif
    /* We can enter an endless loop to safely halt the software execution because the
       handling of External Interrupts is globally switched off (see above). Check your
       memory map if your debugger would make a break in the loop. */
    while(!addressOk)
        ;

       
    /* Set the function pointer in the ISR Handler table. We use the two least significant
       bits of the address to store the information about preemption and kernel relevance.
       This convention is known and considered by the assembler code that implements the
       common part of all INTC interrupts. */
    if(isKernelInterrupt)
    {
        /* A kernel ISR, which can preempt a context then return to and resume another one. */
        int_ivor4KernelIsr_t isr =
#ifdef __VLE__
            (int_ivor4KernelIsr_t)((uintptr_t)interruptHandler.kernelIsr | 0x80000000);
#else
            (int_ivor4KernelIsr_t)((uintptr_t)interruptHandler.kernelIsr | 0x00000002);
#endif
        if(isPreemptable)
            isr = (int_ivor4KernelIsr_t)((uintptr_t)isr | 0x00000001);

        int_INTCInterruptHandlerAry[vectorNum] =
                                        (int_externalInterruptHandler_t){.kernelIsr = isr};
        
