PeterVranken/TRK-USB-MPC5643L/LSM/kernelBuilder/code/startup/ihw_initMcuCoreHW.c
        /* Set the PSR Priority
             The priority ceiling protocol of the INTC doesn't work for kernel interrupts
           and can't be applied to serialilize their servicing. Therefore, we demand that
           all kernel interrupts run on priority 1. */
        assert(psrPriority == 1);
        INTC.PSR[vectorNum].B.PRI = 1;
    }
    else
    {
        /* A simple ISR, which can preempt a context but only return to and resume the same
           context. */
        int_ivor4SimpleIsr_t isr = interruptHandler.simpleIsr;
        if(isPreemptable)
            isr = (int_ivor4SimpleIsr_t)((uintptr_t)isr | 0x00000001);

        int_INTCInterruptHandlerAry[vectorNum] =
                                        (int_externalInterruptHandler_t){.simpleIsr = isr};

        /* Set the PSR Priority */
        INTC.PSR[vectorNum].B.PRI = psrPriority;

    } /* End if(Is it a kernel relevant ISR or not?) */

    ihw_leaveCriticalSection(msr);

} /* End of ihw_installINTCInterruptHandler */



/**
 * Initialize the MCU core hardware, such that it can be safely operated. This relates
 * mainly to the setup of the clocks and PLLs.\n
 *   Additionally, the INTC is configured to serve all the external interrupts in software
 * vector mode. However, before using an interrupt, you will still have to register your
 * handlers, see ihw_installINTCInterruptHandler().
 *   @remark
 * After return the MCU core is fully operational. Further HW initialization can be done in
 * the user code by implementing dedicated drivers. These will configure the I/O devices,
 * enable their interrupt and register the handler using
 * ihw_installINTCInterruptHandler().\n
 *   After having done this for all required devices the user code will call
 * ihw_enableAllInterrupts() to start full MCU operation.
 *   @remark
 * This code is based on NXP sample MPC5643L-LINFlex-UART-DMA-CW210, file main.c, l. 115ff.
 */
void ihw_initMcuCoreHW(void)
{
    /* Check you have cleared all the faults RGM prior to moving from SAFE/DRUN Modes. */
    if(RGM.FES.B.F_FCCU_SAFE || RGM.FES.B.F_FCCU_HARD)
    {
        RGM.FES.R;
        ME.IMTS.R = 0x00000001;
        clearCriticalFaultFlags();
        clearNonCriticalFaultFlags();
        RGM.FES.R = 0xFFFF;
        RGM.DES.R = 0xFFFF;
    }

    /* Initialize the clocks.
         Clock signal output is useless, the CPU pin BP6 is not connected on our eval
       board. */
    initModesAndClks(/* enableClkOutputAtPB6 */ false);

    /* Grant access to the bus masters to the peripherals, particularly CPU and DMA. */
    initPBridge();
    
    /* Initialize the interrupt controller for the external interrupts. No interrupts are
       enabled but the mechansim is in place to register handlers from the user code. */
    initINTCInterruptController();

    /* From here on the MCU is fully operational. Further HW initialization can be done in
       dedicated driver implementations according to the applictaion needs. */

} /* End of ihw_initMcuCoreHW */



